package console;

public enum Menu {

    SEPARATOR("========================================================================================================="),
    HOME_MENU_ADMIN("1-Цвета; 2-Марки; 3-Коробки; 4-Автомобили; 5-Пользователи; 6-Запросы; 7-Аренда; 9-Выйти; 0 - завершение программы"),
    HOME_MENU_CLIENT("1-Автомобили; 2-Запросы; 9-Выйти; 0 - завершение программы"),
    ACDB_MENU("1-Добавить; 2-Изменить; 3-Удалить; 4-Назад; 9-Выйти; 0 - завершение программы"),
    AUTORIZATION_MENU("1-Войти; 2-Регистрация; 0 - завершение программы");

    private String menu;

    Menu(String menu) {
        this.menu = menu;
    }


    @Override
    public String toString() {
        return menu;
    }
}
